app/controllers/users_controller.rb

  def gen
    User.create(:name => 'fulano', :location => 'london', :age => 18)
---
INSERT INTO "users" ("name", "gender", "location", "age", "created_at", "updated_at") VALUES ('fulano', NULL, 'london', 18, '2011-05-12 21:50:36.618411', '2011-05-12 21:50:36.618411')